Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10, 1)        0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 11, 1)        0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10, 128)      256         input_1[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 11, 128)      256         input_2[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 10, 24)       3096        dense_1[0][0]                    
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 11, 24)       3096        dense_5[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 5, 24)        0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 5, 24)        0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 5, 128)       3200        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 5, 128)       3200        max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 5, 48)        6192        dense_2[0][0]                    
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 5, 48)        6192        dense_6[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 2, 48)        0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 2, 48)        0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 96)           0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 96)           0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 32)           3104        flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 32)           3104        flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            33          dense_3[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1)            33          dense_7[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 2)            0           dense_4[0][0]                    
                                                                 dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1)            3           concatenate_1[0][0]              
==================================================================================================
Total params: 31,765
Trainable params: 31,765
Non-trainable params: 0
__________________________________________________________________________________________________
