Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10, 1)        0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 11, 1)        0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10, 128)      256         input_1[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 11, 128)      256         input_2[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 10, 24)       3096        dense_1[0][0]                    
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 11, 24)       3096        dense_4[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 5, 24)        0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 6, 24)        0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 5, 48)        2352        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 6, 48)        2352        max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 3, 48)        0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 3, 48)        0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 3, 40)        14240       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 3, 40)        14240       max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 32)           9344        lstm_1[0][0]                     
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 32)           9344        lstm_3[0][0]                     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           1056        lstm_2[0][0]                     
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 32)           1056        lstm_4[0][0]                     
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            33          dense_2[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            33          dense_5[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 2)            0           dense_3[0][0]                    
                                                                 dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 128)          384         concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 16)           2064        dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 16)           0           dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1)            17          dropout_2[0][0]                  
==================================================================================================
Total params: 63,219
Trainable params: 63,219
Non-trainable params: 0
__________________________________________________________________________________________________
